## 10.1 GroupBy机制

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.364537 -2.028767
1    a  two -0.262438  1.295738
2    b  one  1.390414 -1.743138
3    b  two  0.898743 -0.271987
4    a  one -1.019470 -0.116168

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.305790
b    1.144579
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means

key1  key2
a     one    -0.327467
      two    -0.262438
b     one     1.390414
      two     0.898743
Name: data1, dtype: float64

In [6]:
means.unstack()

key2       one       two
key1
a    -0.327467 -0.262438
b     1.390414  0.898743

In [7]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [8]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [9]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.262438
            2006    1.390414
Ohio        2005    0.631640
            2006   -1.019470
Name: data1, dtype: float64

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.305790 -0.283066
b     1.144579 -1.007562

In [11]:
df

  key1 key2     data1     data2
0    a  one  0.364537 -2.028767
1    a  two -0.262438  1.295738
2    b  one  1.390414 -1.743138
3    b  two  0.898743 -0.271987
4    a  one -1.019470 -0.116168

In [12]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.327467 -1.072467
     two  -0.262438  1.295738
b    one   1.390414 -1.743138
     two   0.898743 -0.271987

In [13]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### 对分组进行迭代

In [14]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.364537 -2.028767
1    a  two -0.262438  1.295738
4    a  one -1.019470 -0.116168
b
  key1 key2     data1     data2
2    b  one  1.390414 -1.743138
3    b  two  0.898743 -0.271987

In [15]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.364537 -2.028767
4    a  one -1.019470 -0.116168
('a', 'two')
  key1 key2     data1     data2
1    a  two -0.262438  1.295738
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.390414 -1.743138
('b', 'two')
  key1 key2     data1     data2
3    b  two  0.898743 -0.271987

In [16]:
pieces = dict(list(df.groupby('key1')))

In [17]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.364537 -2.028767
 1    a  two -0.262438  1.295738
 4    a  one -1.019470 -0.116168, 'b':   key1 key2     data1     data2
 2    b  one  1.390414 -1.743138
 3    b  two  0.898743 -0.271987}

In [18]:
pieces['b']

  key1 key2     data1     data2
2    b  one  1.390414 -1.743138
3    b  two  0.898743 -0.271987

In [24]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.364537 -2.028767
1 -0.262438  1.295738
2  1.390414 -1.743138
3  0.898743 -0.271987
4 -1.019470 -0.116168
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### 选取一列或列的子集

In [32]:
list(df.groupby('key1'))

[('a',   key1 key2     data1     data2
  0    a  one  0.364537 -2.028767
  1    a  two -0.262438  1.295738
  4    a  one -1.019470 -0.116168), ('b',   key1 key2     data1     data2
  2    b  one  1.390414 -1.743138
  3    b  two  0.898743 -0.271987)]

In [33]:
list(df.groupby('key1')['data1'])

[('a', 0    0.364537
  1   -0.262438
  4   -1.019470
  Name: data1, dtype: float64), ('b', 2    1.390414
  3    0.898743
  Name: data1, dtype: float64)]

In [39]:
list(df.groupby('key1')[['data2']])

[('a',   key1 key2     data1     data2
  0    a  one  0.364537 -2.028767
  1    a  two -0.262438  1.295738
  4    a  one -1.019470 -0.116168), ('b',   key1 key2     data1     data2
  2    b  one  1.390414 -1.743138
  3    b  two  0.898743 -0.271987)]

In [37]:
list(df['data1'].groupby(df['key1']))

[('a', 0    0.364537
  1   -0.262438
  4   -1.019470
  Name: data1, dtype: float64), ('b', 2    1.390414
  3    0.898743
  Name: data1, dtype: float64)]

In [38]:
list(df[['data2']].groupby(df['key1']))

[('a',       data2
  0 -2.028767
  1  1.295738
  4 -0.116168), ('b',       data2
  2 -1.743138
  3 -0.271987)]

In [43]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -1.072467
     two   1.295738
b    one  -1.743138
     two  -0.271987

In [44]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [45]:
s_grouped

In [46]:
s_grouped.mean()

key1  key2
a     one    -1.072467
      two     1.295738
b     one    -1.743138
      two    -0.271987
Name: data2, dtype: float64

### 通过字典或Series进行分组

In [47]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     1.445830  0.294682  0.996299 -0.246285 -0.373749
Steve  -0.450588  0.572554 -1.112747  0.594254 -0.571365
Wes    -0.574874  3.127592 -0.155264  0.604059 -0.302900
Jim     1.706738 -1.376329 -2.134740 -1.578007  0.483348
Travis -0.310458  0.198431 -0.435094  0.276262  0.324797

In [51]:
people.iloc[2:3, [1, 2]] = np.nan

In [52]:
people

               a         b         c         d         e
Joe     1.445830  0.294682  0.996299 -0.246285 -0.373749
Steve  -0.450588  0.572554 -1.112747  0.594254 -0.571365
Wes    -0.574874       NaN       NaN  0.604059 -0.302900
Jim     1.706738 -1.376329 -2.134740 -1.578007  0.483348
Travis -0.310458  0.198431 -0.435094  0.276262  0.324797

In [53]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [54]:
by_column = people.groupby(mapping, axis=1)

In [55]:
list(by_column)

[('blue',                c         d
  Joe     0.996299 -0.246285
  Steve  -1.112747  0.594254
  Wes          NaN  0.604059
  Jim    -2.134740 -1.578007
  Travis -0.435094  0.276262), ('red',                a         b         e
  Joe     1.445830  0.294682 -0.373749
  Steve  -0.450588  0.572554 -0.571365
  Wes    -0.574874       NaN -0.302900
  Jim     1.706738 -1.376329  0.483348
  Travis -0.310458  0.198431  0.324797)]

In [56]:
by_column.sum()

            blue       red
Joe     0.750014  1.366763
Steve  -0.518492 -0.449399
Wes     0.604059 -0.877773
Jim    -3.712747  0.813757
Travis -0.158832  0.212770

In [58]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [59]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### 通过函数进行分组

In [60]:
people.groupby(len).sum()
# 函数作用在索引值上

          a         b         c         d         e
3  2.577695 -1.081647 -1.138441 -1.220233 -0.193301
5 -0.450588  0.572554 -1.112747  0.594254 -0.571365
6 -0.310458  0.198431 -0.435094  0.276262  0.324797

In [61]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [62]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.574874  0.294682  0.996299 -0.246285 -0.373749
  two  1.706738 -1.376329 -2.134740 -1.578007  0.483348
5 one -0.450588  0.572554 -1.112747  0.594254 -0.571365
6 two -0.310458  0.198431 -0.435094  0.276262  0.324797

In [63]:
people

               a         b         c         d         e
Joe     1.445830  0.294682  0.996299 -0.246285 -0.373749
Steve  -0.450588  0.572554 -1.112747  0.594254 -0.571365
Wes    -0.574874       NaN       NaN  0.604059 -0.302900
Jim     1.706738 -1.376329 -2.134740 -1.578007  0.483348
Travis -0.310458  0.198431 -0.435094  0.276262  0.324797

### 根据索引级别分组

In [64]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                     [1, 3, 5, 1, 3]],
                                   names=['cty', 'tenor'])

In [65]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [66]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [67]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.789011  0.447803  0.992630  0.932369 -1.003158
1      0.281755 -0.595926  0.863532  1.154366 -1.537176
2      1.566158 -0.634648 -1.042166 -1.033443 -1.321375
3      1.839070 -0.658873 -0.808594 -0.234518  0.335211

In [68]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 10.2 数据聚合

In [69]:
df

  key1 key2     data1     data2
0    a  one  0.364537 -2.028767
1    a  two -0.262438  1.295738
2    b  one  1.390414 -1.743138
3    b  two  0.898743 -0.271987
4    a  one -1.019470 -0.116168

In [70]:
grouped = df.groupby('key1')

In [71]:
grouped['data1'].quantile(0.9)

key1
a    0.239142
b    1.341247
Name: data1, dtype: float64

In [73]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [74]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.384007  3.324505
b     0.491671  1.471151

In [75]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.305790  0.693021 -1.019470 -0.640954 -0.262438  0.051050
b      2.0  1.144579  0.347664  0.898743  1.021661  1.144579  1.267496

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.364537   3.0 -0.283066  1.668525 -2.028767 -1.072467 -0.116168
b     1.390414   2.0 -1.007562  1.040261 -1.743138 -1.375350 -1.007562


           75%       max
key1
a     0.589785  1.295738
b    -0.639774 -0.271987

### 面向列的多函数应用

In [76]:
tips = pd.read_csv('tips.csv')

In [77]:
tips['tip_pct'] = tips['tip']/tips['total_bill']

In [78]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [79]:
grouped = tips.groupby(['day', 'smoker'])

In [80]:
grouped_pct = grouped['tip_pct']

In [81]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [82]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [83]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [84]:
functions = ['count', 'mean', 'max']

In [85]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

In [86]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [87]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [88]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [89]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [90]:
grouped.agg({'tip': np.max, 'size': 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [93]:
grouped.agg({'tip_pct': ['min', 'max', 'mean', 'std'],
            'size': 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

### 以“没有索引”的形式返回聚合数据

In [94]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

## 10.3 apply: 一般性的“拆分-应用-合并”

In [95]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [96]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [97]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [100]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [101]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [102]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [103]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [104]:
f = lambda x: x.describe()

In [105]:
grouped.apply(f)

                   total_bill        tip       size    tip_pct
day  smoker
Fri  No     count    4.000000   4.000000   4.000000   4.000000
            mean    18.420000   2.812500   2.250000   0.151650
            std      5.059282   0.898494   0.500000   0.028123
            min     12.460000   1.500000   2.000000   0.120385
            25%     15.100000   2.625000   2.000000   0.137239
            50%     19.235000   3.125000   2.000000   0.149241
            75%     22.555000   3.312500   2.250000   0.163652
            max     22.750000   3.500000   3.000000   0.187735
     Yes    count   15.000000  15.000000  15.000000  15.000000
            mean    16.813333   2.714000   2.066667   0.174783
            std      9.086388   1.077668   0.593617   0.051293
            min      5.750000   1.000000   1.000000   0.103555
            25%     11.690000   1.960000   2.000000   0.133739
            50%     13.420000   2.500000   2.000000   0.173913
            75%     18.665000   3.240000   2.000000   0.209240
            max     40.170000   4.730000   4.000000   0.263480
Sat  No     count   45.000000  45.000000  45.000000  45.000000
            mean    19.661778   3.102889   2.555556   0.158048
            std      8.939181   1.642088   0.784960   0.039767
            min      7.250000   1.000000   1.000000   0.056797
            25%     14.730000   2.010000   2.000000   0.136240
            50%     17.820000   2.750000   2.000000   0.150152
            75%     20.650000   3.390000   3.000000   0.183915
            max     48.330000   9.000000   4.000000   0.291990
     Yes    count   42.000000  42.000000  42.000000  42.000000
            mean    21.276667   2.875476   2.476190   0.147906
            std     10.069138   1.630580   0.862161   0.061375
            min      3.070000   1.000000   1.000000   0.035638
            25%     13.405000   2.000000   2.000000   0.091797
            50%     20.390000   2.690000   2.000000   0.153624
...                       ...        ...        ...        ...
Sun  No     std      8.130189   1.224785   1.032674   0.042347
            min      8.770000   1.010000   2.000000   0.059447
            25%     14.780000   2.000000   2.000000   0.139780
            50%     18.430000   3.020000   3.000000   0.161665
            75%     25.000000   3.920000   4.000000   0.185185
            max     48.170000   6.000000   6.000000   0.252672
     Yes    count   19.000000  19.000000  19.000000  19.000000
            mean    24.120000   3.516842   2.578947   0.187250
            std     10.442511   1.261151   0.901591   0.154134
            min      7.250000   1.500000   2.000000   0.065660
            25%     17.165000   3.000000   2.000000   0.097723
            50%     23.100000   3.500000   2.000000   0.138122
            75%     32.375000   4.000000   3.000000   0.215325
            max     45.350000   6.500000   5.000000   0.710345
Thur No     count   45.000000  45.000000  45.000000  45.000000
            mean    17.113111   2.673778   2.488889   0.160298
            std      7.721728   1.282964   1.179796   0.038774
            min      7.510000   1.250000   1.000000   0.072961
            25%     11.690000   1.800000   2.000000   0.137741
            50%     15.950000   2.180000   2.000000   0.153492
            75%     20.270000   3.000000   2.000000   0.184843
            max     41.190000   6.700000   6.000000   0.266312
     Yes    count   17.000000  17.000000  17.000000  17.000000
            mean    19.190588   3.030000   2.352941   0.163863
            std      8.355149   1.113491   0.701888   0.039389
            min     10.340000   2.000000   2.000000   0.090014
            25%     13.510000   2.000000   2.000000   0.148038
            50%     16.470000   2.560000   2.000000   0.153846
            75%     19.810000   4.000000   2.000000   0.194837
            max     43.110000   5.000000   4.000000   0.241255

[64 rows x 4 columns]

### 禁止分组键

In [106]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

### 分位数和桶分析

In [107]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [108]:
quartiles = pd.cut(frame.data1, 4)

In [110]:
quartiles[:10]

0      (1.758, 3.419]
1    (-1.565, 0.0962]
2     (0.0962, 1.758]
3     (0.0962, 1.758]
4     (0.0962, 1.758]
5    (-1.565, 0.0962]
6     (0.0962, 1.758]
7    (-1.565, 0.0962]
8    (-1.565, 0.0962]
9     (0.0962, 1.758]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.233, -1.565] < (-1.565, 0.0962] < (0.0962, 1.758] < (1.758, 3.419]]

In [114]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
           'count': group.count(), 'mean': group.mean()}

In [112]:
grouped = frame.data2.groupby(quartiles)

In [118]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-3.233, -1.565]   60.0  2.594450 -0.042196 -2.430206
(-1.565, 0.0962]  474.0  2.905059 -0.059814 -3.410702
(0.0962, 1.758]   426.0  2.924682 -0.056585 -3.100790
(1.758, 3.419]     40.0  2.666017  0.184809 -1.684646

In [123]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [124]:
grouped = frame.data2.groupby(grouping)

In [126]:
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  2.594450  0.035899 -2.430206
1      100.0  1.912335 -0.079259 -2.908390
2      100.0  2.432446 -0.105018 -3.410702
3      100.0  1.845245 -0.110774 -2.298656
4      100.0  2.905059 -0.001847 -2.540831
5      100.0  2.368971 -0.011047 -2.384691
6      100.0  2.370279 -0.050367 -3.100790
7      100.0  2.924682  0.044601 -2.249260
8      100.0  2.216961 -0.142438 -2.727217
9      100.0  2.666017 -0.055713 -1.932236

### 示例： 用特定于分组的值填充缺失值

In [127]:
s = pd.Series(np.random.randn(6))

In [128]:
s

0   -0.069408
1   -0.201260
2    0.607496
3   -0.911559
4    0.586425
5    0.335023
dtype: float64

In [129]:
s[::2] = np.nan

In [130]:
s

0         NaN
1   -0.201260
2         NaN
3   -0.911559
4         NaN
5    0.335023
dtype: float64

In [131]:
s.fillna(s.mean())

0   -0.259265
1   -0.201260
2   -0.259265
3   -0.911559
4   -0.259265
5    0.335023
dtype: float64

In [132]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']

In [133]:
group_key = ['East']*4 + ['West']*4

In [134]:
group_key

['East', 'East', 'East', 'East', 'West', 'West', 'West', 'West']

In [135]:
data = pd.Series(np.random.randn(8), index=states)

In [136]:
data

Ohio         -0.958950
New York     -0.272228
Vermont       0.574002
Florida       0.446550
Oregon       -1.000088
Nevada        0.916486
California   -0.123611
Idaho        -0.024659
dtype: float64

In [137]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio         -0.958950
New York     -0.272228
Vermont            NaN
Florida       0.446550
Oregon       -1.000088
Nevada             NaN
California   -0.123611
Idaho              NaN
dtype: float64

In [138]:
data.groupby(group_key).mean()

East   -0.261543
West   -0.561849
dtype: float64

In [139]:
fill_mean = lambda g: g.fillna(g.mean())

In [140]:
data.groupby(group_key).apply(fill_mean)

Ohio         -0.958950
New York     -0.272228
Vermont      -0.261543
Florida       0.446550
Oregon       -1.000088
Nevada       -0.561849
California   -0.123611
Idaho        -0.561849
dtype: float64

In [141]:
fill_values = {'East': 0.5, 'West': -1}

In [142]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [144]:
data.groupby(group_key).apply(fill_func)

Ohio         -0.958950
New York     -0.272228
Vermont       0.500000
Florida       0.446550
Oregon       -1.000088
Nevada       -1.000000
California   -0.123611
Idaho        -1.000000
dtype: float64

### 示例： 随机采样和排列

In [145]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']

In [148]:
card_val = (list(range(1, 11)) + [10]*3) * 4

In [149]:
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [150]:
cards = []

In [151]:
for suit in suits:
    cards.extend(str(num) + suit for num in base_names)

In [152]:
deck = pd.Series(card_val, index=cards)

In [154]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [155]:
def draw(deck, n=5):
    return deck.sample(n)

In [156]:
draw(deck)

10S    10
8H      8
2S      2
AS      1
JS     10
dtype: int64

In [157]:
get_suit = lambda card: card[-1]
deck.groupby(get_suit).apply(draw, n=2)

C  QC     10
   2C      2
D  7D      7
   9D      9
H  7H      7
   10H    10
S  JS     10
   7S      7
dtype: int64

In [158]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

QC    10
7C     7
4D     4
6D     6
KH    10
2H     2
8S     8
AS     1
dtype: int64

### 示例： 分组加权平均数和相关系数

In [159]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a','b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [160]:
df

  category      data   weights
0        a -0.693515  0.036671
1        a  0.861499  0.938440
2        a  0.316696  0.447789
3        a  0.264603  0.070163
4        b  0.717091  0.000863
5        b -1.484398  0.925767
6        b -0.374153  0.640420
7        b  0.534066  0.774885

In [161]:
grouped = df.groupby('category')

In [162]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [163]:
grouped.apply(get_wavg)

category
a    0.631863
b   -0.512125
dtype: float64

In [167]:
close_px = pd.read_csv('stock_px_2.csv', parse_dates=True,
                       index_col=0)

In [168]:
close_px.head()

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01
2003-01-07  7.43  21.93  28.95  922.93
2003-01-08  7.28  21.31  28.83  909.93

In [169]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
AAPL    2214 non-null float64
MSFT    2214 non-null float64
XOM     2214 non-null float64
SPX     2214 non-null float64
dtypes: float64(4)
memory usage: 86.5 KB

In [170]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [171]:
rets = close_px.pct_change().dropna()

In [173]:
rets

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
2003-01-10  0.002725  0.001824 -0.013927  0.000000
2003-01-13 -0.005435  0.008648 -0.004134 -0.001412
2003-01-14 -0.002732  0.010379  0.008993  0.005830
2003-01-15 -0.010959 -0.012506 -0.013713 -0.014426
2003-01-16  0.012465 -0.016282  0.004519 -0.003942
2003-01-17 -0.035568 -0.070345 -0.010381 -0.014017
2003-01-21 -0.005674 -0.002473 -0.023077 -0.015702
2003-01-22 -0.009986 -0.006445 -0.012885 -0.010432
2003-01-23  0.021614  0.024950 -0.002175  0.010224
2003-01-24 -0.026798 -0.046251 -0.021439 -0.029233
2003-01-27  0.024638 -0.013783 -0.026736 -0.016160
2003-01-28  0.031117 -0.007246  0.026326  0.013050
2003-01-29  0.024691  0.022419  0.036431  0.006779
2003-01-30 -0.041499 -0.033656 -0.018293 -0.022849
2003-01-31  0.002793 -0.015831  0.027768  0.013130
2003-02-03  0.020891  0.023056  0.013864  0.005399
2003-02-04 -0.004093 -0.025681  0.000000 -0.014088
2003-02-05 -0.010959 -0.007531 -0.014376 -0.005435
2003-02-06  0.000000  0.009756 -0.008538 -0.006449
2003-02-07 -0.020776 -0.017713 -0.007535 -0.010094
2003-02-10  0.015559  0.017486  0.007592  0.007569
2003-02-11  0.000000 -0.019871 -0.007176 -0.008098
2003-02-12  0.002786  0.000000 -0.019877 -0.012687
2003-02-13  0.009722  0.011507  0.012906 -0.001600
2003-02-14  0.009629  0.028169  0.009465  0.021435
...              ...       ...       ...       ...
2011-09-02 -0.018319 -0.015643 -0.018370 -0.025282
2011-09-06  0.015212 -0.011240 -0.013723 -0.007436
2011-09-07  0.011034  0.019208  0.035137  0.028646
2011-09-08  0.000547  0.008462 -0.011270 -0.010612
2011-09-09 -0.017337 -0.018307 -0.024856 -0.026705
2011-09-12  0.006517  0.005828  0.011688  0.006966
2011-09-13  0.012318  0.005794 -0.002645  0.009120
2011-09-14  0.012168  0.017665  0.013817  0.013480
2011-09-15  0.009401  0.018491  0.018860  0.017187
2011-09-16  0.019188  0.004817  0.007296  0.005707
2011-09-19  0.027790  0.003319 -0.011402 -0.009803
2011-09-20  0.004421 -0.008453  0.004206 -0.001661
2011-09-21 -0.003168 -0.036694 -0.027564 -0.029390
2011-09-22 -0.025040 -0.035783 -0.037932 -0.031883
2011-09-23  0.006172  0.000000  0.001011  0.006082
2011-09-26 -0.002795  0.015164  0.034771  0.023336
2011-09-27 -0.009698  0.009041  0.016592  0.010688
2011-09-28 -0.005635 -0.003506 -0.011521 -0.020691
2011-09-29 -0.016221 -0.005082  0.025114  0.008114
2011-09-30 -0.023683 -0.022004 -0.016919 -0.024974
2011-10-03 -0.017623 -0.014464 -0.020377 -0.028451
2011-10-04 -0.005606  0.033021  0.023612  0.022488
2011-10-05  0.015436  0.021705  0.015378  0.017866
2011-10-06 -0.002327  0.017381 -0.000811  0.018304
2011-10-07 -0.020060 -0.003417 -0.004466 -0.008163
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2213 rows x 4 columns]

In [174]:
get_year = lambda x: x.year

In [175]:
by_year = rets.groupby(get_year)

In [177]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [178]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

### 组级别的线性回归

In [180]:
import statsmodels.api as sm

In [181]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [184]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

## 10.4 透视表和交叉表

In [186]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [187]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [188]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [189]:
tips.pivot_table('tip_pct', index=['time', 'day'],
                columns='smoker', aggfunc=len, margins=True)

smoker          No   Yes    All
time   day
Dinner Fri     3.0   9.0   12.0
       Sat    45.0  42.0   87.0
       Sun    57.0  19.0   76.0
       Thur    1.0   NaN    1.0
Lunch  Fri     1.0   6.0    7.0
       Thur   44.0  17.0   61.0
All          151.0  93.0  244.0

In [191]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                columns='day', aggfunc='mean', margins=True,
                fill_value=0)

day                      Fri       Sat       Sun      Thur       All
time   size smoker
Dinner 1    No      0.000000  0.137931  0.000000  0.000000  0.137931
            Yes     0.000000  0.325733  0.000000  0.000000  0.325733
       2    No      0.139622  0.162705  0.168859  0.159744  0.164383
            Yes     0.171297  0.148668  0.207893  0.000000  0.167246
       3    No      0.000000  0.154661  0.152663  0.000000  0.153705
            Yes     0.000000  0.144995  0.152660  0.000000  0.148061
       4    No      0.000000  0.150096  0.148143  0.000000  0.148737
            Yes     0.117750  0.124515  0.193370  0.000000  0.139064
       5    No      0.000000  0.000000  0.206928  0.000000  0.206928
            Yes     0.000000  0.106572  0.065660  0.000000  0.086116
       6    No      0.000000  0.000000  0.103799  0.000000  0.103799
Lunch  1    No      0.000000  0.000000  0.000000  0.181728  0.181728
            Yes     0.223776  0.000000  0.000000  0.000000  0.223776
       2    No      0.000000  0.000000  0.000000  0.166005  0.166005
            Yes     0.181969  0.000000  0.000000  0.158843  0.165266
       3    No      0.187735  0.000000  0.000000  0.084246  0.118742
            Yes     0.000000  0.000000  0.000000  0.204952  0.204952
       4    No      0.000000  0.000000  0.000000  0.138919  0.138919
            Yes     0.000000  0.000000  0.000000  0.155410  0.155410
       5    No      0.000000  0.000000  0.000000  0.121389  0.121389
       6    No      0.000000  0.000000  0.000000  0.173706  0.173706
All                 0.169913  0.153152  0.166897  0.161276  0.160803

In [193]:
data = pd.read_csv('data.csv')

In [194]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [195]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [196]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244